In [1]:
%load_ext sql

In [2]:
%%sql sqlite:///imdb.db
SELECT COUNT(*)
  FROM media;

Done.

[(500,)]

# Film le plus long

In [3]:
%%sql sqlite:///imdb.db
SELECT *
  FROM media
 LIMIT 1;

Done.

[('tt13452446', 'Movie', 'Damsel', 'Damsel', 'Action, Adventure, Fantasy', 6600, 2024, None, 6.1, 47971, 46, 'PG-13', 'United States', 70000000, 70000000, 'Millie Bobby Brown, Ray Winstone, Angela Bassett, Brooke Carter, Nick Robinson, Robin Wright, Milo Twomey, Nicole Joseph, Patrice Naiambana, Ulli Ackermann, Mens-Sana Tamakloe, Ezra Faroque Khan, Tasha Lim, Brogan Mcfarlane, Sonya Nisa, Esther Odumade, Margarita Ren, Eloise Shephard Taylor', 'A dutiful damsel agrees to marry a handsome prince, only to find the royal family has recruited her as a sacrifice to repay an ancient debt.', 'https://m.media-amazon.com/images/M/MV5BODRiMTA4NGMtOTQzZC00OWFjLWFmODctMjY2ZTcwYjI5NDMyXkEyXkFqcGdeQXVyMDc5ODIzMw@@._V1_.jpg')]

In [4]:
%%sql sqlite:///imdb.db
SELECT title, duration_s
  FROM media
 WHERE kind='Movie'
 ORDER BY duration_s DESC
 LIMIT 1;

Done.

[('Gone with the Wind', 14280)]

# 5 Films les mieux notés

In [5]:
%%sql sqlite:///imdb.db
SELECT title, rating, vote_count
  FROM media
 WHERE kind='Movie'
 ORDER BY rating DESC
 LIMIT 5;

Done.

[('The Shawshank Redemption', 9.3, 2872739),
 ('The Godfather', 9.2, 2000949),
 ('The Godfather Part II', 9.0, 1357466),
 ('The Lord of the Rings: The Return of the King', 9.0, 1968380),
 ("Schindler's List", 9.0, 1442959)]

# Nombre de films incluant Morgan Freeman... Tom Cruise

In [6]:
%%sql sqlite:///imdb.db
SELECT COUNT(title)
  FROM media
 WHERE (kind='Movie') AND (casting LIKE '%Morgan Freeman%');

Done.

[(5,)]

In [7]:
%%sql sqlite:///imdb.db
SELECT title
  FROM media
 WHERE (kind='Movie') AND (casting LIKE '%Morgan Freeman%');

Done.

[('Batman Begins',),
 ('Se7en',),
 ('The Dark Knight Rises',),
 ('The Shawshank Redemption',),
 ('The Dark Knight',)]

In [8]:
%%sql sqlite:///imdb.db
SELECT COUNT(title)
  FROM media
 WHERE (kind='Movie') AND (casting LIKE '%Tom Cruise%');

Done.

[(2,)]

In [9]:
%%sql sqlite:///imdb.db
SELECT title
  FROM media
 WHERE (kind='Movie') AND (casting LIKE '%Tom Cruise%');

Done.

[('Top Gun: Maverick',), ('Mission: Impossible - Dead Reckoning Part One',)]

# Quels sont les 3 meilleurs films d'horreur? Dramatique? Comique?

## Horreur

In [12]:
%%sql sqlite:///imdb.db
SELECT title
  FROM media
 WHERE kind='Movie' AND genres LIKE '%Horror%'
 ORDER BY rating DESC
 LIMIT 3;

Done.

[('Alien',), ('Bramayugam',), ('Shaitaan',)]

## Dramatique

In [13]:
%%sql sqlite:///imdb.db
SELECT title
  FROM media
 WHERE kind='Movie' AND genres LIKE '%Drama%'
 ORDER BY rating DESC
 LIMIT 3;

Done.

[('The Shawshank Redemption',), ('The Godfather',), ('The Godfather Part II',)]

## Comique

In [14]:
%%sql sqlite:///imdb.db
SELECT title
  FROM media
 WHERE kind='Movie' AND genres LIKE '%Comedy%'
 ORDER BY rating DESC
 LIMIT 3;

Done.

[('Snatch',), ('Green Book',), ('The Wolf of Wall Street',)]

## Parmi les 100 films les mieux notés, quel pourcentage sont américains? Français?

In [40]:
%%sql sqlite:///imdb.db
SELECT COUNT(*) / 100.0 AS US_percentage
FROM (
    SELECT id, countries
    FROM media
    WHERE kind='Movie'AND countries LIKE '%United States%'
    ORDER BY rating
    LIMIT 100
) AS subquery;

Done.

[(1.0,)]

In [35]:
%%sql sqlite:///imdb.db
SELECT id, countries
  FROM media
 WHERE (kind='Movie') AND (countries LIKE '%United States%')
 ORDER BY rating
 LIMIT 100;

Done.

[('tt6263850', 'United States, China'),
 ('tt5177120', 'United States, United Kingdom, Turkey'),
 ('tt11315808', 'United States'),
 ('tt30144839', 'United States'),
 ('tt31378509', 'United States'),
 ('tt14824600', 'United States, Japan, United Kingdom'),
 ('tt11389872', 'United States'),
 ('tt9218128', 'United Kingdom, United States'),
 ('tt4978420', 'United States'),
 ('tt1262426', 'United States'),
 ('tt2049403', 'United States'),
 ('tt16426418', 'United States'),
 ('tt22022452', 'United States, Japan'),
 ('tt5672290', 'United States, Italy, United Kingdom'),
 ('tt14856980', 'United States'),
 ('tt1684562', 'United States'),
 ('tt14539740', 'United States'),
 ('tt21235248', 'United States, Canada'),
 ('tt1340094', 'United Kingdom, France, United States'),
 ('tt3359350', 'United States'),
 ('tt31122323', 'United States, India'),
 ('tt30007864', 'United States, Denmark'),
 ('tt11057302', 'United States, Canada, Mexico'),
 ('tt0938283', 'United States'),
 ('tt26861992', 'United States'),
 ('tt2322441', 'United States'),
 ('tt30215084', 'United States'),
 ('tt16253418', 'United States'),
 ('tt26658104', 'United States'),
 ('tt1524515', 'United States'),
 ('tt19364132', 'United States'),
 ('tt0108162', 'United States'),
 ('tt26943420', 'United States'),
 ('tt13380324', 'United States'),
 ('tt8310486', 'United States'),
 ('tt6722802', 'Ireland, Spain, France, United States'),
 ('tt21957774', 'Ireland, United States'),
 ('tt4589218', 'United States'),
 ('tt10676048', 'United States'),
 ('tt11304740', 'United States'),
 ('tt14998742', 'United States'),
 ('tt9663764', 'United States, United Kingdom, Canada, Australia, Iceland'),
 ('tt11097384', 'Czech Republic, United States'),
 ('tt14764464', 'Canada, United States'),
 ('tt19356262', 'United States, United Kingdom'),
 ('tt23137390', 'Italy, United States'),
 ('tt1959490', 'United States'),
 ('tt27550567', 'United States'),
 ('tt11762114', 'United States'),
 ('tt15009428', 'United Kingdom, United States'),
 ('tt8002382', 'United States'),
 ('tt14362112', 'United States'),
 ('tt0053559', 'United States'),
 ('tt13452446', 'United States'),
 ('tt2177771', 'Germany, United States'),
 ('tt11235772', 'United States'),
 ('tt21188080', 'United States'),
 ('tt21830902', 'United States'),
 ('tt9466114', 'United States'),
 ('tt26047818', 'United States, Australia'),
 ('tt7711170', 'United States'),
 ('tt0116287', 'United States, Canada'),
 ('tt1660648', 'United States'),
 ('tt0087182', 'United States, Mexico'),
 ('tt1448754', 'United States, Canada, Australia'),
 ('tt0086927', 'United States'),
 ('tt10731256', 'United States'),
 ('tt15314262', 'United States, United Kingdom'),
 ('tt15671028', 'United States'),
 ('tt13287846', 'United States, United Kingdom'),
 ('tt14230388', 'Germany, United States'),
 ('tt1790809', 'United States, Australia, United Kingdom, Canada'),
 ('tt1462764', 'United States'),
 ('tt14160834', 'United States'),
 ('tt13560574', 'United States, Canada'),
 ('tt19864802', 'United States'),
 ('tt3758542', 'United States, United Kingdom, Italy, China'),
 ('tt12747748', 'United States'),
 ('tt8521778', 'United States'),
 ('tt5535276', 'United States'),
 ('tt21692408', 'United States, China'),
 ('tt22041854', 'Italy, United States'),
 ('tt0367594', 'United States, United Kingdom'),
 ('tt8105234', 'United States'),
 ('tt0439572', 'United States, Canada, Australia, New Zealand'),
 ('tt17527468', 'United States'),
 ('tt6495056', 'United States'),
 ('tt0098206', 'United States'),
 ('tt17024450', 'United States, Italy'),
 ('tt13274016', 'United States'),
 ('tt10545296', 'United States, Canada'),
 ('tt11858890', 'United States'),
 ('tt13651794', 'United States'),
 ('tt1661199', 'United Kingdom, United States, Denmark, Canada, Italy'),
 ('tt1200263', 'United States'),
 ('tt1517268', 'United States, United Kingdom'),
 ('tt17351924', 'United Kingdom, United States'),
 ('tt10720352', 'United States'),
 ('tt15789038', 'United States'),
 ('tt1856080', 'United States')]

In [36]:
%%sql sqlite:///imdb.db
SELECT id, countries
  FROM media
 WHERE (kind='Movie') AND (countries LIKE '%France%')
 ORDER BY rating
 LIMIT 100;

Done.

[('tt1340094', 'United Kingdom, France, United States'),
 ('tt6722802', 'Ireland, Spain, France, United States'),
 ('tt3774694', 'France, Belgium'),
 ('tt17009348', 'France'),
 ('tt20234774', 'United Kingdom, France'),
 ('tt3464902', 'Ireland, United Kingdom, Greece, France, Netherlands, United States, Belgium'),
 ('tt19760052', 'France, Belgium'),
 ('tt5726616', 'Italy, France, United States, Brazil'),
 ('tt5013056', 'United Kingdom, Netherlands, France, United States'),
 ('tt17009710', 'France'),
 ('tt6791350', 'United States, New Zealand, France, Canada'),
 ('tt10366460', 'France, Canada, United States'),
 ('tt1255953', 'Canada, France'),
 ('tt0110413', 'France, United States')]

In [41]:
%%sql sqlite:///imdb.db
SELECT COUNT(*) / 100.0 AS FR_percentage
FROM (
    SELECT id, countries
    FROM media
    WHERE (kind='Movie') AND (countries LIKE '%France%')
    ORDER BY rating
    LIMIT 100
) AS subquery;

Done.

[(0.14,)]

In [43]:
%%sql sqlite:///imdb.db

(sqlite3.OperationalError) no such column: duration
[SQL: SELECT
    json_each.value AS genre,
    AVG(duration) AS average_duration
FROM
    films,
    json_each(json('[', replace(genres, ',', '","'), ']'))
GROUP BY
    genre;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)